{
    "label.social.email.title": "Email - Enviar un email a ricardohuaripatabellido@gmail.com",
    "label.social.linkedin.title": "LinkedIn - Con茅ctate conmigo en LinkedIn",
    "label.social.github.title": "GitHub - Visita mi perfil en GitHub",
    "label.social.github.project.title": "GitHub - Visitar repositorio en GitHub",

    "label.navbar.about": "Sobre mi",
    "label.navbar.tech": "Tecnolog铆as",
    "label.navbar.projects": "Proyectos",
    "label.navbar.contact": "Contacto",

    "label.home.about.hello": "Hola, <span class='shiny-title'>soy Ricardo</span>",
    "label.home.about.developer": "Desarrollador web",
    "label.home.about.resume": "Curriculum",
    "label.home.about.presentation": "隆Hola Mundo!  Soy Ricardo, un apasionado de la programaci贸n y de la tecnolog铆a. Con una formaci贸n en <span class='shiny-text'>desarrollo de aplicaciones web</span>, actualmente me encuentro en un emocionante viaje de aprendizaje para especializarme como <span class='shiny-text'>desarrollador backend</span> y para explorar nuevas oportunidades en la industria del desarrollo de software.",
    "label.home.tech.title": "Tecnolog铆as",
    "label.home.projects.title": "Proyectos",
    "label.home.contact.title": "Contacto",
    "label.home.contact.form.name": "Nombre",
    "label.home.contact.form.email": "Correo electr贸nico",
    "label.home.contact.form.subject": "Asunto",
    "label.home.contact.form.message": "Mensaje",
    "label.home.contact.form.submit": "Enviar",
    "label.home.contact.form.submitted.alert.title": "隆Enviado!",
    "label.home.contact.form.submitted.alert.text": "Mensaje enviado. Gracias por tu inter茅s, nos comunicaremos pronto.",
    "label.home.contact.form.required.field": "Campo requerido",
    "label.home.contact.form.invalid.email": "Correo electr贸nico inv谩lido",
    "label.home.tech.description": "En mi viaje por el <span class='shiny-text'>mundo del desarrollo web</span>, he cultivado experiencia y habilidades en una variedad de tecnolog铆as. <span class='shiny-text'>Mi stack tecnol贸gico incluye:</span>",
    "label.home.projects.description": "Mis proyectos m谩s emocionantes y creativos. Cada proyecto es el resultado de mi dedicaci贸n y pasi贸n por la programaci贸n, y estoy encantado de compartirlos contigo. Descubre c贸mo transformo <span class='shiny-text'>ideas en realidades digitales</span>. 隆Explora, inspira y crea con mis proyectos de software!",
    "label.home.contact.description": "Puedes comunicarte conmigo a trav茅s de este formulario o por algunas de mis redes sociales.",
    "label.home.tech.stack.tools": "Herramientas",
    "label.home.tech.stack.learning": "Aprendiendo",
    
    "label.project.visit.github": "Visitar repositorio",
    "label.project.summary.title": "Resumen",
    "label.project.description.title": "Descripci贸n",
    "label.project.features.title": "Caracter铆sticas",
    "label.project.tech.title": "Tecnolog铆as",

    "label.project.ogs-ecommerce.summary": "Este proyecto se trata de un ecommerce completo con backend y frontend que ofrece todas las funcionalidades que caracterizan a un ecommerce. Permite gestionar productos, pedidos, usuarios y autenticaci贸n, entre otras caracter铆sticas.",
    "label.project.ogs-ecommerce.description": "Este proyecto est谩 basado en la p谩gina <a href='https://www.ogsbrand.com/es/' target='_blank'>https://www.ogsbrand.com</a>, gran parte del dise帽o de su interfaz de usuario ha sido copiada con el prop贸sito de omitir la fase de branding y dise帽o, pudiendo as铆 centrarse en el desarrollo de la interfaz a nivel de comunicaci贸n entre cliente y servidor. <br><br>Como backend tenemos una API RESTful desarrollada con Spring Boot que ofrece funcionalidades para un ecommerce de ropa. Permite gestionar productos, pedidos, usuarios y autenticaci贸n, entre otras caracter铆sticas. <br>En cuanto frontend se us贸 Angular y Bootstrap, junto con bibliotecas como ngx-translate para el multilenguaje y PrimeNG y SweetAlert2 para facilitar el desarrollo de la interfaz.",
    "label.project.ogs-ecommerce.features": "<ul><li> Catalogo de productos</li><li> Carrito de compras</li><li> Pasarela de pago</li><li> Autenticaci贸n y registro de usuarios</li><li> Gesti贸n de la informaci贸n del usuario</li><li> Historial de pedidos</li><li> Recuperaci贸n de la contrase帽a</li><li> Notificaciones por correo electr贸nico</li><li> Responsive design</li><li> Multilenguaje</li></ul>",

    "label.project.ashon-ecommerce.summary": "Proyecto final de ciclo en el que se desarroll贸 aplicaci贸n web de arquitectura cliente-servidor que consiste en una tienda online para la venta de ropa para hombres y mujeres. La aplicaci贸n busca ofrecer una experiencia de usuario excepcional al proporcionar una interfaz atractiva y moderna, garantizando una navegaci贸n eficiente por los productos y una experiencia de compra intuitiva.",
    "label.project.ashon-ecommerce.description": "Proyecto final de ciclo en el que se desarroll贸 aplicaci贸n web de arquitectura cliente-servidor que consiste en una tienda online para la venta de ropa para hombres y mujeres. La aplicaci贸n busca ofrecer una experiencia de usuario excepcional al proporcionar una interfaz atractiva y moderna, garantizando una navegaci贸n eficiente por los productos y una experiencia de compra intuitiva. <br><br>En cuanto a las tecnolog铆as utilizadas, se utiliz贸 Angular junto con HTML, CSS y JavaScript para el desarrollo de la interfaz gr谩fica. Para el desarrollo del servidor y de la API, se utiliz贸 Node.js con Express.js, se implement贸 una base de datos no relacional con MongoDB y se implementaron librer铆as como Cloudinary para el almacenamiento en la nube de imagenes de productos, OAuth2 para el inicio de sesi贸n con Google, la librer铆a Nodemailer junto con OAuth2 para el enviar correos electr贸nicos de verificaci贸n o de restablecimiento de contrase帽as y la librer铆a de Stripe para el procesamiento de pagos en l铆nea. <br><br>Adem谩s, <span class='shiny-text'>se estableci贸 una metodolog铆a 谩gil para el desarrollo del proyecto</span>, lo que permiti贸 la entrega incremental de las funcionalidades. Finalmente, se llev贸 a cabo el despliegue de la aplicaci贸n utilizando servicios de terceros como Heroku para el alojamiento del servidor y AWS Amplify para el alojamiento de la aplicaci贸n cliente.",
    "label.project.ashon-ecommerce.features": "<ul><li> Catalogo de productos</li><li> Carrito de compras</li><li> Pasarela de pago</li><li> Autenticaci贸n y registro de usuarios</li><li> Gesti贸n de la informaci贸n del usuario</li><li> Historial de pedidos</li><li> Recuperaci贸n de la contrase帽a</li><li> Notificaciones por correo electr贸nico</li><li> Responsive design</li></ul>",

    "label.project.4-pics-1-word.summary": "4 Fotos 1 Palabra lo define su propio nombre, ya que consiste en tratar de adivinar el acertijo que se oculta detr谩s de las cuatro fotos presentadas en la pantalla. Este acertijo se resume en una sola palabra, la cual guarda relaci贸n con las fotograf铆as de cada partida.",
    "label.project.cinesa-web.summary": "Recreaci贸n de la p谩gina oficial de cinesa.es imitando su dise帽o y estructura. Llev茅 a cabo este proyecto con el prop贸sito de aprender a dise帽ar una p谩gina con el popular framework de css, Tailwind. Este framework me permiti贸 maquetar m谩s de 6 p谩ginas distintas de forma muy r谩pida y 贸ptima para un dise帽o web adaptable."

}